app/Controllers/admin/Bpn.php

    public function indexArtikel()
    {
        $data['artikels'] = $this->artikelModel->orderBy('tanggal_publikasi', 'DESC')->findAll();
---
SELECT *
FROM `tb_artikel`
ORDER BY `tanggal_publikasi` DESC