app/Controllers/admin/Bpw.php

    private function resolvePublisherLabel(): string
    {
        $role = strtolower((string) session()->get('role'));

        switch ($role) {
            case 'bpw': {
                $name = $this->lookup('tb_provinsi', 'id_provinsi', session()->get('id_provinsi'), 'nama_provinsi');
                return $name ?: 'BPW';
            }
            case 'bpd': {
                $name = $this->lookup('tb_kota_kabupaten', 'id_kota', session()->get('id_kota'), 'nama_kota');
                return $name ?: 'BPD';
            }
            case 'bpdes': {
                $name = $this->lookup('tb_desa_kelurahan', 'id_desa', session()->get('id_desa'), 'nama_desa');
---
SELECT `nama_provinsi`
FROM `tb_provinsi`
WHERE `id_provinsi` = '1'
SELECT *
FROM `tb_provinsi`
WHERE `tb_provinsi`.`id_provinsi` = '1'