app/Controllers/Home.php

    public function index()
    {
        // Ambil 4 artikel terbaru
        $latestArticles = $this->artikelModel
            ->orderBy('tanggal_publikasi', 'DESC')
            ->limit(4)
            ->findAll();
---
SELECT *
FROM `tb_artikel`
ORDER BY `tanggal_publikasi` DESC
 LIMIT 4