app/Models/ArtikelModel.php

SELECT *
FROM `tb_artikel`
WHERE `status` = 'approved'
ORDER BY `tanggal_publikasi` DESC
---
    public function getApprovedArticles()
    {
        return $this->where('status', 'approved')
                    ->orderBy('tanggal_publikasi', 'DESC')
                    ->findAll();

SELECT *
FROM `tb_artikel`
WHERE `status` = 'approved'
AND `kategori` = 'Lingkungan & Keberlanjutan'
ORDER BY `tanggal_publikasi` DESC
---
    public function getByCategory($kategori)
    {
        return $this->where('status', 'approved')
                    ->where('kategori', $kategori)
                    ->orderBy('tanggal_publikasi', 'DESC')
                    ->findAll();